---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.HotConductorsNumber
source: html/72dff106-1130-55db-bb3e-bd86143798e1.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.HotConductorsNumber Property

The HotConductors Number of the Electrical System.

## Syntax (C#)
```csharp
public int HotConductorsNumber { get; }
```

## Remarks
This property is used to retrieve the HotConductors Number of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!